In [164]:
data1=dict()

In [165]:
c1=["Dheeraj","Chandan","Ramesh","Mohit","Sunil"]
c2=[89,85,95,91,82]
c3=[83,88,85,96,81]
c4=[94,81,90,86,86]
col=["Name","Maths","Physics","Chemistry"]

data1=dict()

for i in range(len(col)):  
    data1[col[i]] = [x[i] for x in list(zip(c1, c2, c3, c4))]

data1

{'Name': ['Dheeraj', 'Chandan', 'Ramesh', 'Mohit', 'Sunil'],
 'Maths': [89, 85, 95, 91, 82],
 'Physics': [83, 88, 85, 96, 81],
 'Chemistry': [94, 81, 90, 86, 86]}

In [166]:
import pandas as pd
data1=pd.DataFrame(data1)
data1

      Name  Maths  Physics  Chemistry
0  Dheeraj     89       83         94
1  Chandan     85       88         81
2   Ramesh     95       85         90
3    Mohit     91       96         86
4    Sunil     82       81         86

In [167]:
from collections import defaultdict

data2 = defaultdict(int)
print("a : ",data2["a"])

my_dict = defaultdict(int)
print("b : ",my_dict['b'])  # Output: 0

my_dict["a"] += 1
print("a : ",my_dict['a'])  # Output: 1

my_dict['b']=my_dict['b']+10
print("b : ",my_dict['b'])  # Output: 10

a :  0
b :  0
a :  1
b :  10

In [168]:
from collections import defaultdict

data2 = defaultdict(list)
data2[10].append(1)
data2[10].append(10)
data2[20].append(2)

print(data2)
data2[30]

defaultdict(<class 'list'>, {10: [1, 10], 20: [2]})

[]

In [169]:
from collections import defaultdict

data2 = defaultdict(dict)

data2["a"] = 10
data2["b"] = 20
data2["c"] = 30
print(data2)
data2["d"]

defaultdict(<class 'dict'>, {'a': 10, 'b': 20, 'c': 30})

{}

In [170]:
data1.iloc[2:4,1:3]

   Maths  Physics
2     95       85
3     91       96

In [171]:
data1.iloc[:,:][(((data1["Name"]=="Dheeraj") | (data1["Name"]=="Ramesh")) & (data1["Maths"]>90))]

     Name  Maths  Physics  Chemistry
2  Ramesh     95       85         90

In [172]:
data1[((data1["Name"]=="Dheeraj") | (data1["Name"]=="Ramesh")) & (data1["Maths"]<90)]

      Name  Maths  Physics  Chemistry
0  Dheeraj     89       83         94

In [173]:
data3={
    'Name': ['Dheeraj', 'Chandan', 'Ramesh', 'Mohit', 'Sunil'],
    'Maths': [89, None, 95, 91, 82],
    'Physics': [83, 88, None, 96, None],
    'Chemistry': [94, 81, 90, None, 86]
    }
data3

{'Name': ['Dheeraj', 'Chandan', 'Ramesh', 'Mohit', 'Sunil'],
 'Maths': [89, None, 95, 91, 82],
 'Physics': [83, 88, None, 96, None],
 'Chemistry': [94, 81, 90, None, 86]}

In [174]:
data3.get("a")

In [175]:
data3.get("Chemistry")

[94, 81, 90, None, 86]

In [176]:
data3.fromkeys("data3")

{'d': None, 'a': None, 't': None, '3': None}

In [177]:
data3.fromkeys("data3",0)

{'d': 0, 'a': 0, 't': 0, '3': 0}

In [178]:
data3

{'Name': ['Dheeraj', 'Chandan', 'Ramesh', 'Mohit', 'Sunil'],
 'Maths': [89, None, 95, 91, 82],
 'Physics': [83, 88, None, 96, None],
 'Chemistry': [94, 81, 90, None, 86]}

In [179]:
import copy
new_data3=copy.deepcopy(data3)
new_data3

{'Name': ['Dheeraj', 'Chandan', 'Ramesh', 'Mohit', 'Sunil'],
 'Maths': [89, None, 95, 91, 82],
 'Physics': [83, 88, None, 96, None],
 'Chemistry': [94, 81, 90, None, 86]}

In [180]:
new_data3.pop("Chemistry")

[94, 81, 90, None, 86]

In [181]:
new_data3

{'Name': ['Dheeraj', 'Chandan', 'Ramesh', 'Mohit', 'Sunil'],
 'Maths': [89, None, 95, 91, 82],
 'Physics': [83, 88, None, 96, None]}

In [182]:
new_data3.popitem()

('Physics', [83, 88, None, 96, None])

In [183]:
new_data3.setdefault("BV")
new_data3

{'Name': ['Dheeraj', 'Chandan', 'Ramesh', 'Mohit', 'Sunil'],
 'Maths': [89, None, 95, 91, 82],
 'BV': None}

In [185]:
import pandas as pd
data3=pd.DataFrame(data3)
data3

      Name  Maths  Physics  Chemistry
0  Dheeraj   89.0     83.0       94.0
1  Chandan    NaN     88.0       81.0
2   Ramesh   95.0      NaN       90.0
3    Mohit   91.0     96.0        NaN
4    Sunil   82.0      NaN       86.0

In [187]:
data3.T.to_numpy()

array([['Dheeraj', 'Chandan', 'Ramesh', 'Mohit', 'Sunil'],
       [89.0, nan, 95.0, 91.0, 82.0],
       [83.0, 88.0, nan, 96.0, nan],
       [94.0, 81.0, 90.0, nan, 86.0]], dtype=object)

In [193]:
data3["Maths"]=data3["Maths"].fillna(data3["Maths"].median())
data3["Physics"]=data3["Physics"].fillna(data3["Physics"].median())
data3["Chemistry"]=data3["Chemistry"].fillna(data3["Chemistry"].median())
data3

      Name  Maths  Physics  Chemistry
0  Dheeraj   89.0     83.0       94.0
1  Chandan   90.0     88.0       81.0
2   Ramesh   95.0     88.0       90.0
3    Mohit   91.0     96.0       88.0
4    Sunil   82.0     88.0       86.0

In [194]:
new_data3.popitem

{'Name': ['Dheeraj', 'Chandan', 'Ramesh', 'Mohit', 'Sunil'],
 'Maths': [89, None, 95, 91, 82],
 'BV': None}